import 'package:flutter/material.dart';
import 'package:zakat_calculator/screens/zakat_rules/widgets/qna_item.dart';

import '../../app_utils/app_colors.dart';
import '../../app_utils/appfonts.dart';
import '../../app_utils/size_config.dart';
import '../../custom_widgets/custom_app_bar.dart';





class ZakatRulesScreen extends StatefulWidget {
  const ZakatRulesScreen({super.key});

  @override
  State<ZakatRulesScreen> createState() => _ZakatRulesScreenState();
}

class _ZakatRulesScreenState extends State<ZakatRulesScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: AppColors.appBackgroundColor,
      body:Stack(
        alignment: Alignment.center,
        children: [
          Column(
            mainAxisAlignment: MainAxisAlignment.center,
            crossAxisAlignment: CrossAxisAlignment.center,
            children: [
              SizedBox(
                height: getProportionateScreenHeight(80),
              ),
              Container(
                height: getProportionateScreenHeight(200),
                width: getProportionateScreenWidth(200),
                child: Opacity(
                  opacity: 0.25,
                  child: Image.asset(
                    "assets/images/zakat_rule_bg.png",
                    fit: BoxFit.cover,
                  ),
                ),
              ),
            ],
          ),
          Container(
            height: MediaQuery.of(context).size.height,
            width: MediaQuery.of(context).size.width,
            child: Column(
              children: [
                SizedBox(
                  height: getProportionateScreenHeight(35),
                ),
                CustomAppBar(icon: "assets/images/conversation.png", title: "মাসআলা মাসায়েল"),


                Expanded(
                  child: ListView(
                    physics: BouncingScrollPhysics(),
                    children: [
                      Padding(
                        padding: EdgeInsets.symmetric(horizontal: 15),
                        child:  Text("*** এখানে অবগতির জন্য মৌলিকভাবে কিছু অতি প্রয়োজনীয় মাসআলা উল্লেখ করা হল। প্রায়োগিক ক্ষেত্রে যার উপর যাকাত ফরয, তিনি কোন ফতোয়া বিভাগ বা মুফতি সাহেবের শরণাপন্ন হয়ে নিজ সংশ্লিষ্ট যাবতীয় খুঁটিনাটি মাসআলা জেনে নিবেন ।", style: TextStyle(color: AppColors.blackTextColor, fontSize: 13, fontWeight: FontWeight.w700, fontFamily: AppFonts.RalewayRegular),),
                      ),
                      SizedBox(
                        height: getProportionateScreenHeight(5),
                      ),
                      QnAItem(question: "১. আমাদের দেশের কোন কোন সম্পদে যাকাত ফরয? ", answer: "আমাদের দেশের প্রেক্ষাপটে সাধারণত যাকাত ফরয হয় চার ধরণের সম্পদে। ১. স্বর্ণ। ২. রূপা। ৩. টাকা-পয়সা। ৪. ব্যবসায়িক সম্পদ। অতএব বাসা-বাড়ি, ফ্ল্যাট, প্লট, জমি ও গাড়ি ইত্যাদি যদি ব্যবসার উদ্দেশ্যে (অর্থাৎ বিক্রি করার নিয়তে) ক্রয় করে থাকে, তাহলে এর (বর্তমান বিক্রয়) মূল্যের উপর যাকাত ফরয। কারণ এগুলো তখন ব্যবসার পণ্য হিসেবে পরিগণিত হবে। তবে ব্যবসার উদ্দেশ্যে ক্রয় না করে থাকলে তাতে যাকাত ফরয নয়, যদিও তা প্রয়োজনের অতিরিক্ত হয় বা ভাড়ায় প্রদানের জন্য হয় ।"),
                      QnAItem(question: "২. শুধুমাত্র সোনা বা রুপা থাকলে কি হিসেবে যাকাত দিতে হবে ?  ", answer: "কারো মালিকানায় যদি কেবল স্বর্ণ থাকে; আর উল্লেখযোগ্য পরিমাণ জমা টাকা, রূপা বা ব্যবসায়িক সম্পদ না থাকে তবে তার মালিকানাধীন স্বর্ণের পরিমাণ ৭.৫ ভরি (তোলা) = ৮৭.৪৮ গ্রাম বা এর বেশি হতে হবে। ৭.৫ ভরি (তোলা) এর কম হলে তার উপর যাকাত ফরয হবে না। তেমনি কারো কাছে যদি শুধু রূপা থাকে; বাকি তিন ধরণের সম্পদের কোনটি না থাকে, তাহলে রূপার পরিমাণ ৫২.৫ ভরি (তোলা) = ৬১২.৩৬ গ্রাম হতে হবে । এর কম হলে তার উপর যাকাত ফরয হবে না। , উল্লেখ্য, সোনা, রূপা বা অন্যান্য সম্পদের উপরোক্ত পরিমাণকে পরিভাষায় ‘নেসাব’ বলে ।"),
                      QnAItem(question: "৩. যদি নেসাব পরিমান সোনা বা রুপার সমমুল্যে টাকা থাকে তাহলে কি হিসেবে যাকাত দিতে হবে ?  ", answer: "স্বর্ণ ও রূপা যদি পৃথকভাবে নেসাব পরিমাণ (অর্থাৎ স্বর্ণ ৭.৫ ভরি, আর রূপা ৫২.৫ ভরি) না থাকে, তবে উভয়টি মিলে কিংবা এগুলোর সাথে উল্লেখযোগ্য পরিমাণ জমা টাকা বা ব্যবসায়িক সম্পদ মিলে ৫২.৫ ভরি রূপার সমমূল্যের হয়ে যায় তাহলেও তার জন্য উপরে উল্লেখিত পরিমাণ যাকাত ফরয হবে।"),
                      QnAItem(question: "৪. কোন ধরনের জমা টাকার উপর যাকাত দিতে হবে ? ", answer: "জমা টাকা-পয়সার উপর সর্বাবস্থায় যাকাত ফরয। তা যে উদ্দেশ্যেই জমা রাখা হোক। অতএব ঘরবাড়ি নির্মাণ, বিয়ে-শাদি বা এধরণের কোন প্রয়োজনের জন্য টাকা জমা করলেও তা যদি এককভাবে বা অন্য সম্পদের সাথে মিলে নেসাব পরিমাণ হয়, এবং বছর পূর্ণ হয়ে যায় তাহলে এরও যাকাত আদায় করতে হবে। মৌলিক প্রয়োজন অর্থাৎ নিয়মিত (মাসিক) খরচের জন্য থেকে যাওয়া টাকার যাকাত দেওয়া জরুরী নয়।"),
                      QnAItem(question: "৫. যাকাত দেওয়ার জন্য সম্পদ কতদিন স্থায়ী হওয়া প্রয়োজন? ", answer: "যাকাতযোগ্য সম্পদের মালিক হওয়ার সাথে সাথেই যাকাত আদায় করা ফরয হয়ে যায় না, বরং তখন থেকে এক বছর অতিক্রম হওয়ার পর যদি উপরে উল্লেখিত পরিমাণ যাকাতযোগ্য সম্পদ থাকে তখন তার উপর যাকাত আদায় করা ফরয হয়।"),
                      QnAItem(question: "৬. যাকাত দেওয়ার জন্য ভিন্ন ভিন্ন সম্পদের জন্য ভিন্ন ভিন্ন ভাবে বছর অতিবাহিত হওয়ার প্রয়োজন আছে কি ? ", answer: "যাকাতযোগ্য সম্পদের প্রত্যেকটির উপর ভিন্নভিন্নভাবে বছর অতিবাহিত হওয়া জরুরী নয়। বরং মূল নেসাবের উপর বছর অতিবাহিত হওয়াই যথেষ্ট। তাই (আরবি তারিখ অনুযায়ী) যে দিন বছর পূর্ণ হবে সেদিন নেসাব পরিমাণ সম্পদের অধিকারী ব্যক্তির মালিকানায় যত যাকাতযোগ্য সম্পদ থাকবে সমুদয় সম্পদের যাকাত আদায় করতে হবে। এর আগের দিনও যদি তার মালিকানায় যাকাতযোগ্য কোন সম্পদ যুক্ত হয়, তবে এরও যাকাত আদায় করতে হবে।"),
                      QnAItem(question: "৭. অন্যকে কাছে পাওনা টাকার উপরে কি যাকাত দিতে হবে ? ", answer: "অন্যের কাছে পাওনা অর্থের উপরও যাকাত ফরয। ঐ ব্যক্তি ঋণ আদায়ে গড়িমসি করলেও যদি তা পাওয়ার সম্ভাবনা থাকে, তবে এরও যাকাত আদায় করতে হবে। এক্ষেত্রে পাওনাদার চাইলে এখনই এর যাকাত আদায় না করে, টাকা পাওয়ার পর আদায় করতে পারে। সেক্ষেত্রে বিগত বছরগুলোর যাকাতও আদায় করতে হবে । আর কোন ক্ষেত্রে যদি ঋণ না পাওয়ার সম্ভাবনা প্রবল হয়ে যায়, তাহলে এ টাকার যাকাত আদায় করা লাগবে না ।"),
                      QnAItem(question: "৮. কোন ধরনের ঋণ এর টাকা যাকাত যোগ্য সম্পদ থেকে বাদ দিতে হবে ? ", answer: "ডেভেলপমেন্ট ঋণ ও ইনস্টলমেন্টের ভিত্তিতে কিস্তিতে প্রদেয় মেয়াদী ঋণ ছাড়া অন্যান্য সাধারণ ঋণ যাকাতযোগ্য সম্পদ থেকে বিয়োগ করা হবে। ডেভেলপমেন্ট ঋণ ও ইনস্টলমেন্টের ভিত্তিতে কিস্তিতে প্রদেয় মেয়াদী ঋণের ক্ষেত্রে মাসআলায় কিছুটা ভিন্নতা রয়েছে। ডেভেলপমেন্ট ঋণ নিয়ে যদি তা যাকাত দেওয়া ফরয নয় এমন সম্পদ ক্রয় বা নির্মাণ ইত্যাদির পেছনে ব্যয় করা হয়, তবে তা অন্যান্য যাকাতযোগ্য সম্পদ থেকে বিয়োগ হবে না । আর ইনস্টলমেন্টের ভিত্তিতে কিস্তিতে প্রদেয় মেয়াদি ঋণের পুরোটাই যাকাত থেকে বিয়োগ হবে না। বরং এ ধরণের ঋণের কেবল এক বছরের কিস্তি যাকাতের সম্পদ থেকে বিয়োগ করা যাবে।"),
                      QnAItem(question: "৯. যাকাতের অর্থ কিভাবে প্রদান করতে হবে ? ", answer: "যাকাতের অর্থ শরিয়তে নির্ধারিত খাতে ব্যক্তিকে মালিক বানানোর পদ্ধতিতে প্রদান করা জরুরী। নতুবা যাকাত আদায় হবে না। তবে মালিক বানানোর বিষয়টি তাকে সরাসরি প্রদানের মাধ্যমেও হতে পারে, আবার তার প্রতিনিধিকে প্রদানের মাধ্যমেও হতে পারে । এমনকি তার অনুমতিক্রমে তার ঋণ পরিশোধ করে দেওয়ার মাধ্যমেও হতে পারে। এসবই মালিক বানিয়ে দেওয়ার অন্তর্ভুক্ত। এভাবে কাউকে মালিক বানানো ছাড়া জনকল্যাণমূলক কাজে যাকাতের অর্থ দেওয়া যাবে না। এমনকি কাউকে মালিক না বানিয়ে শুধু গরিবদের ভোগ-ব্যবহারের জন্য কোন কিছু দিলেও এর দ্বারা যাকাত আদায় হবে না ।"),

                    ],
                  ),
                )
              ],
            ),
          )
        ],
      ),
    );
  }
}
